app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "description", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Profile"], ["description", ""], ["pet_id", 1], ["created_at", 2016-07-27 19:21:57 UTC], ["updated_at", 2016-07-27 19:21:57 UTC]]
---
  def create
  	@album = Album.new(album_params)
    if @album.save

SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1  [["id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 1]]
---
  def show
    @album = set_album
    @pet_id = set_pet_id
    @pet = Pet.where(id: @pet_id)
    @photos = Photo.where(album_id: @album.id)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 39]]
---
  def delete
    @album = set_album
    @pet_id = @album.pet_id
    @album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def set_album
    Album.find(params[:id])