app/controllers/pets_controller.rb

  def main
    @pets = Pet.where(user_id: current_user.id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 1]]

  def create
    @pet = Pet.new(pet_params)
    if @pet.save
---
INSERT INTO "pets" ("name", "gender", "breed", "bio", "species", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "Fat Cat"], ["gender", ""], ["breed", ""], ["bio", ""], ["species", "Cat"], ["user_id", 2], ["created_at", 2016-07-28 00:17:47 UTC], ["updated_at", 2016-07-28 00:17:47 UTC]]

  def show
    @pet = set_pet
    @albums = Album.where(pet_id: @pet.id)
    photos = Photo.all
---
SELECT "albums".* FROM "albums" WHERE "albums"."pet_id" = $1  [["pet_id", 1]]
SELECT "photos".* FROM "photos"

  def update
  	@pet = set_pet
    if @pet.update_attributes(pet_params)
---
UPDATE "pets" SET "gender" = $1, "breed" = $2, "species" = $3, "bio" = $4, "updated_at" = $5 WHERE "pets"."id" = $6  [["gender", "Female"], ["breed", "Siberian Husky"], ["species", "Dog"], ["bio", "A puppy with unlimited energy."], ["updated_at", 2016-07-27 21:23:29 UTC], ["id", 8]]

  def delete
  	@pet = set_pet
  	@pet.destroy
---
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 38]]

  def follow
    @user = current_user
    @pet = set_pet
    @follow = Follower.new(user_id: @user.id, pet_id: @pet.id)
    if @follow.save
---
INSERT INTO "followers" ("user_id", "pet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["pet_id", 40], ["created_at", 2016-07-28 04:53:10 UTC], ["updated_at", 2016-07-28 04:53:10 UTC]]

  def unfollow
    @pet = set_pet
    follow = Follower.where(user_id: current_user.id, pet_id: @pet.id)
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = $1 AND "followers"."pet_id" = $2  [["user_id", 1], ["pet_id", 40]]

  def set_pet
  	Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]