app/controllers/photos_controller.rb

  def create
  	@photo = Photo.new(photo_params)
    @album_id = set_album_id
    @pet_id = set_pet_id
    if @photo.save
---
INSERT INTO "photos" ("description", "album_id", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Profile"], ["album_id", 1], ["created_at", 2016-07-27 19:23:39 UTC], ["updated_at", 2016-07-27 19:23:39 UTC], ["avatar", "WP_20160710_11_51_43_Pro.jpg"]]

  def show
    @photo = set_photo
    @album_id = set_album_id
    @pet_id = set_pet_id
    @pet = Pet.where(id: @pet_id)
---
SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1  [["id", 2]]

  def update
    @photo = set_photo
    @album_id = set_album_id
    @pet_id = set_pet_id
    if @photo.update_attributes(photo_params)
---
UPDATE "photos" SET "avatar" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["avatar", "WP_20160713_20_22_04_Pro.jpg"], ["updated_at", 2016-07-28 19:15:45 UTC], ["id", 1]]

  def delete
    @photo = set_photo
    @album_id = set_album_id
    @pet_id = set_pet_id
    @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 4]]

  def set_photo
    Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]