app/controllers/users_controller.rb

  def main

    #sort pets with search
    if params[:search]
      @pets = Pet.search(params[:search])
    else
    	@pets = Pet.all
    end
    # @pets = Pet.search(params[:search])
  	@photos = Photo.all
  	@pet_array = []
    @pet_indexes = []
  	@photo_array = []
    @following_pets = []
    @following_photos = []

    #collect all pets being followed
    if user_signed_in?
      followings = Follower.where(user_id: current_user.id)
      followings.each do |follow|
        pet = Pet.where(id: follow.pet_id)
        @following_pets << pet[0]
        album = Album.where(pet_id: pet[0].id)
        photo = Photo.where(album_id: album[0].id)
---
SELECT "pets".* FROM "pets" WHERE (search_terms ILIKE '%cat%')
SELECT "photos".* FROM "photos"
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = $1  [["user_id", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "albums".* FROM "albums" WHERE "albums"."pet_id" = $1  [["pet_id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = $1  [["album_id", 1]]